GopalSaraf/Practicals/PSDL/include/proc/pic16f15325.h
extern volatile PIR3bits_t PIR3bits __at(0x70F);
// bitfield macros
#define _PIR3_SSP1IF_POSN                                   0x0
#define _PIR3_SSP1IF_POSITION                               0x0
#define _PIR3_SSP1IF_SIZE                                   0x1
#define _PIR3_SSP1IF_LENGTH                                 0x1
#define _PIR3_SSP1IF_MASK                                   0x1
#define _PIR3_BCL1IF_POSN                                   0x1
#define _PIR3_BCL1IF_POSITION                               0x1
#define _PIR3_BCL1IF_SIZE                                   0x1
#define _PIR3_BCL1IF_LENGTH                                 0x1
#define _PIR3_BCL1IF_MASK                                   0x2
#define _PIR3_TX1IF_POSN                                    0x4
#define _PIR3_TX1IF_POSITION                                0x4
#define _PIR3_TX1IF_SIZE                                    0x1
#define _PIR3_TX1IF_LENGTH                                  0x1
#define _PIR3_TX1IF_MASK                                    0x10
#define _PIR3_RC1IF_POSN                                    0x5
#define _PIR3_RC1IF_POSITION                                0x5
#define _PIR3_RC1IF_SIZE                                    0x1
#define _PIR3_RC1IF_LENGTH                                  0x1
#define _PIR3_RC1IF_MASK                                    0x20
#define _PIR3_TX2IF_POSN                                    0x6
#define _PIR3_TX2IF_POSITION                                0x6
#define _PIR3_TX2IF_SIZE                                    0x1
#define _PIR3_TX2IF_LENGTH                                  0x1
#define _PIR3_TX2IF_MASK                                    0x40
#define _PIR3_RC2IF_POSN                                    0x7
#define _PIR3_RC2IF_POSITION                                0x7
#define _PIR3_RC2IF_SIZE                                    0x1
#define _PIR3_RC2IF_LENGTH                                  0x1
#define _PIR3_RC2IF_MASK                                    0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x710);
#ifndef _LIB_BUILD
asm("PIR4 equ 0710h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR2IF                 :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x710);
// bitfield macros
#define _PIR4_TMR1IF_POSN                                   0x0
#define _PIR4_TMR1IF_POSITION                               0x0
#define _PIR4_TMR1IF_SIZE                                   0x1
#define _PIR4_TMR1IF_LENGTH                                 0x1
#define _PIR4_TMR1IF_MASK                                   0x1
#define _PIR4_TMR2IF_POSN                                   0x1
#define _PIR4_TMR2IF_POSITION                               0x1
#define _PIR4_TMR2IF_SIZE                                   0x1
#define _PIR4_TMR2IF_LENGTH                                 0x1
#define _PIR4_TMR2IF_MASK                                   0x2

// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x711);
#ifndef _LIB_BUILD
asm("PIR5 equ 0711h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIF                :1;
        unsigned                        :3;
        unsigned CLC1IF                 :1;
        unsigned CLC2IF                 :1;
        unsigned CLC3IF                 :1;
        unsigned CLC4IF                 :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x711);
// bitfield macros
#define _PIR5_TMR1GIF_POSN                                  0x0
#define _PIR5_TMR1GIF_POSITION                              0x0
#define _PIR5_TMR1GIF_SIZE                                  0x1
#define _PIR5_TMR1GIF_LENGTH                                0x1
#define _PIR5_TMR1GIF_MASK                                  0x1
#define _PIR5_CLC1IF_POSN                                   0x4
#define _PIR5_CLC1IF_POSITION                               0x4
#define _PIR5_CLC1IF_SIZE                                   0x1
#define _PIR5_CLC1IF_LENGTH                                 0x1
#define _PIR5_CLC1IF_MASK                                   0x10
#define _PIR5_CLC2IF_POSN                                   0x5
#define _PIR5_CLC2IF_POSITION                               0x5
#define _PIR5_CLC2IF_SIZE                                   0x1
#define _PIR5_CLC2IF_LENGTH                                 0x1
#define _PIR5_CLC2IF_MASK                                   0x20
#define _PIR5_CLC3IF_POSN                                   0x6
#define _PIR5_CLC3IF_POSITION                               0x6
#define _PIR5_CLC3IF_SIZE                                   0x1
#define _PIR5_CLC3IF_LENGTH                                 0x1
#define _PIR5_CLC3IF_MASK                                   0x40
#define _PIR5_CLC4IF_POSN                                   0x7
#define _PIR5_CLC4IF_POSITION                               0x7
#define _PIR5_CLC4IF_SIZE                                   0x1
#define _PIR5_CLC4IF_LENGTH                                 0x1
#define _PIR5_CLC4IF_MASK                                   0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x712);
#ifndef _LIB_BUILD
asm("PIR6 equ 0712h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IF                 :1;
        unsigned CCP2IF                 :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x712);
// bitfield macros
#define _PIR6_CCP1IF_POSN                                   0x0
#define _PIR6_CCP1IF_POSITION                               0x0
#define _PIR6_CCP1IF_SIZE                                   0x1
#define _PIR6_CCP1IF_LENGTH                                 0x1
#define _PIR6_CCP1IF_MASK                                   0x1
#define _PIR6_CCP2IF_POSN                                   0x1
#define _PIR6_CCP2IF_POSITION                               0x1
#define _PIR6_CCP2IF_SIZE                                   0x1
#define _PIR6_CCP2IF_LENGTH                                 0x1
#define _PIR6_CCP2IF_MASK                                   0x2

